import './footer.scss'
import logo from './../../img/logo.svg'
import vk from './../../img/vk.svg'
import ok from './../../img/ok.svg'

function Footer () {
  return (
    <footer className='footer'>
      <div className="footer-img">
        <div className="footer_dark-overlay"></div>
        <div className="footer_logo">
          <img src={logo} alt="КАЛЕЙДОСКОП" />
        </div>
        <div className="footer-slogan inter24-700">
          Когда хочется сделать красиво и надолго
        </div>
        <div className="footer-desc inter16-500">
          Мы собрали надёжные и понятные 
          материалы, с которыми ремонт становится проще, 
          а результат — действительно радует.
        </div>
      </div>
      <div className="footer-info">
        <div className="footer_main-info">
          <div className="footer-nav">
            <div className="footer-nav_title inter20-700">
              Навигация
            </div>
            <div className="footer-nav_list footer_list inter14-300">
              <p>Магазины</p>
              <p>Доставка и оплата</p>
              <p>Поставщикам</p>
              <p>Юридическим лицам</p>
            </div>
          </div>
          <div className="footer_info-container">
            <div className="footer-about">
              <div className="footer-about_title inter20-700">
                О нас
              </div>
              <div className="footer-about_list footer_list inter14-300">
                <p>Вакансии</p>
                <p>Контакты</p>
                <p>Блог</p>
              </div>
            </div>
            <div className="footer-net">
              <div className="footer-net_title inter20-700">
                Соц сети
              </div>
              <div className="footer-net_list footer_list">
                <div className="footer-net_item">
                  <img src={vk} alt="" />
                </div>
                <div className="footer-net_item">
                  <img src={ok} alt="" />
                </div>
              </div>
            </div>
          </div>
          <div className="footer_contact-container">
            <div className="footer-contacts">
              <div className="footer_contacts-icon">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M23.1885 17.7597L20.639 15.2102C20.0549 14.6261 19.2775 14.3365 18.5057 14.4157C17.8401 14.4841 17.2539 14.835 16.8975 15.3783L15.9844 16.77C14.9279 16.5472 12.182 15.8043 10.1889 13.8112C8.19559 11.8179 7.45267 9.07143 7.23011 8.01571L8.62187 7.10264C9.1652 6.74615 9.51601 6.15998 9.58445 5.49435C9.66376 4.72279 9.37412 3.94528 8.78997 3.36107L6.24048 0.811635C5.45425 0.025447 4.31397 -0.217788 3.40291 0.206338C1.68649 1.00518 0.529473 2.64356 0.144957 4.81959C-0.206839 6.81056 0.0845823 9.11076 0.987722 11.4716C1.93985 13.9605 3.52905 16.3619 5.58358 18.4165C7.63806 20.4711 10.0396 22.0603 12.5284 23.0123C14.2394 23.6668 15.9182 24 17.4708 24C18.0606 24 18.6324 23.9519 19.1804 23.8551C21.3564 23.4706 22.9948 22.3136 23.7937 20.5972C24.2178 19.686 23.9746 18.5458 23.1885 17.7597ZM22.4836 19.9874C21.7221 21.6233 20.1303 22.2197 18.929 22.432C15.1676 23.0965 10.3302 21.1193 6.60545 17.3946C2.88072 13.6698 0.903441 8.83251 1.56808 5.07098C1.78033 3.86971 2.37672 2.27793 4.01266 1.51649C4.11658 1.46812 4.23213 1.44487 4.35255 1.44487C4.64613 1.44487 4.96825 1.5832 5.21847 1.83337L7.768 4.38285C8.03931 4.65417 8.18087 5.01445 8.14675 5.34656C8.12969 5.5125 8.06078 5.74223 7.82908 5.8942L6.03663 7.0702C5.80422 7.22273 5.67986 7.49498 5.7168 7.77046C5.73967 7.94086 6.30958 11.9756 9.16703 14.8329C12.0244 17.6903 16.0591 18.2603 16.2295 18.2832C16.5048 18.3202 16.7772 18.1959 16.9298 17.9634L18.1058 16.1709C18.2578 15.9392 18.4875 15.8703 18.6534 15.8533C18.9858 15.819 19.3458 15.9607 19.6171 16.232L22.1666 18.7815C22.5194 19.1343 22.6498 19.6302 22.4836 19.9874Z" fill="#FF4F19"/>
                  <path d="M22.4836 19.9874C21.7221 21.6233 20.1303 22.2197 18.929 22.432C15.1676 23.0965 10.3302 21.1193 6.60545 17.3946C2.88072 13.6698 0.903441 8.83251 1.56808 5.07098C1.78033 3.86971 2.37672 2.27793 4.01266 1.51649C4.11658 1.46812 4.23213 1.44487 4.35255 1.44487C4.64613 1.44487 4.96825 1.5832 5.21847 1.83337L7.768 4.38285C8.03931 4.65417 8.18087 5.01445 8.14675 5.34656C8.12969 5.5125 8.06078 5.74223 7.82908 5.8942L6.03663 7.0702C5.80422 7.22273 5.67986 7.49498 5.7168 7.77046C5.73967 7.94086 6.30958 11.9756 9.16703 14.8329C12.0244 17.6903 16.0591 18.2603 16.2295 18.2832C16.5048 18.3202 16.7772 18.1959 16.9298 17.9634L18.1058 16.1709C18.2578 15.9392 18.4875 15.8703 18.6534 15.8533C18.9858 15.819 19.3458 15.9607 19.6171 16.232L22.1666 18.7815C22.5194 19.1343 22.6498 19.6302 22.4836 19.9874Z" fill="#FF4F19"/>
                </svg>
              </div>
              <div className="footer_contacts-text">
                <p className="footer_contacts-number inter16-500">
                  8-800-100-16-55
                </p>
                <p className="footer_contacts-schedule inter12-400">
                  пн-сб с 08:00 до 20:00
                </p>
              </div>
            </div>
            <div className="footer-address">
              <div className="footer_address-icon">
                <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M25.7349 10.7349C25.7349 13.1654 24.0294 17.017 20.6646 22.1812C18.2071 25.9549 15.7138 29.1015 15.6892 29.1326L15 30L14.3109 29.1326C14.2863 29.1015 11.793 25.9549 9.33555 22.1812C5.97074 17.017 4.26514 13.1654 4.26514 10.7349C4.26514 4.81582 9.08096 0 15 0C20.9191 0 25.7349 4.81582 25.7349 10.7349Z" fill="#FF4F19"/>
                  <path d="M25.7349 10.7349C25.7349 13.1654 24.0294 17.017 20.6645 22.1812C18.2071 25.9549 15.7138 29.1015 15.6892 29.1326L15 30V0C20.9191 0 25.7349 4.81582 25.7349 10.7349Z" fill="#FF4F19"/>
                  <path d="M20.1542 10.4065C20.1542 13.2481 17.8422 15.5607 15 15.5607C12.1578 15.5607 9.8457 13.2481 9.8457 10.4065C9.8457 7.56425 12.1578 5.2522 15 5.2522C17.8422 5.2522 20.1542 7.56425 20.1542 10.4065Z" fill="#B5B5B5"/>
                  <path d="M20.1543 10.4064C20.1543 13.248 17.8422 15.5607 15 15.5607V5.2522C17.8422 5.2522 20.1543 7.56419 20.1543 10.4064Z" fill="#CECECE"/>
                </svg>
              </div>
              <p className="footer_address-text inter14-500">
                г. Нижняя Тура
              </p>
            </div>
          </div>
        </div>
        <div className="footer-links">
          <p className='inter13-400'>Политика конфиденциальности</p>
          <p className='inter13-400'>Крупная сеть ТЦ © Калейдоскоп  2022</p>
        </div>
      </div>
    </footer>
  )
}

export default Footer;